'''
Дан произвольный список. Вывести на экран в обратном порядке. 
Задачу решить 2мя способами. 
'''

a = [1, 2, 3, 'hi']

print(a[::-1])

a.reverse()
print(a)

